[
{"word":"Algorithme","definition":"Suite finie d'instructions exécutables permettant de résoudre un problème ou d'accomplir une tâche."},
{"word":"Cache","definition":"Zone de stockage temporaire qui garde des données fréquemment utilisées pour accélérer les accès."},
{"word":"Résilience","definition":"Capacité d'un système ou d'une personne à reprendre son fonctionnement après une perturbation."},
{"word":"Heuristique","definition":"Méthode pratique utilisée pour trouver rapidement une solution approximative à un problème complexe."},
{"word":"Écosystème","definition":"Ensemble d'organismes vivants et de leur environnement interagissant comme un système."},
{"word":"Dérivé","definition":"Taux de variation instantané d'une fonction par rapport à sa variable (en mathématiques)."},
{"word":"Isomorphe","definition":"Qui présente une correspondance structurelle parfaite entre deux objets dans un contexte donné."},
{"word":"Nonce","definition":"Valeur unique utilisée une seule fois dans des protocoles cryptographiques pour empêcher la répétition."},
{"word":"Latence","definition":"Délai entre l'envoi d'une requête et la réception de sa réponse."},
{"word":"Empathie","definition":"Capacité à comprendre et ressentir les émotions d'autrui sans les confondre avec les siennes."},
{"word":"Idempotent","definition":"Propriété d'une opération qui donne le même résultat quelle que soit le nombre d'applications."},
{"word":"Polymorphe","definition":"Qualifie un objet ou une fonction qui peut prendre plusieurs formes ou types selon le contexte."},
{"word":"Anachronisme","definition":"Erreur de chronologie qui place un élément dans une époque qui n'est pas la sienne."},
{"word":"Sémaphore","definition":"Mécanisme de synchronisation utilisé en informatique pour contrôler l'accès concurrent à une ressource."},
{"word":"Hyperbole","definition":"Figure de style qui exagère volontairement pour mettre en valeur une idée."},
{"word":"Tangible","definition":"Qui peut être perçu physiquement, palpé ou mesuré."},
{"word":"Métaphore","definition":"Comparaison implicite où un élément en remplace un autre pour en suggérer les caractéristiques."},
{"word":"Cryptomonnaie","definition":"Monnaie numérique sécurisée par cryptographie, généralement décentralisée sur une blockchain."},
{"word":"Robustesse","definition":"Capacité d'un système à maintenir ses fonctions malgré des perturbations ou des erreurs."},
{"word":"Cachet","definition":"Marque officielle ou signature qui atteste de l'authenticité d'un document ou d'un produit."}
]